Maxjta/hal_at32/include/dt-bindings/pinctrl/at32f435z(m)xx-pinctrl.h
 /* I2S2_WS */
 #define I2S2_WS_PA11 \
	 AT32_PIN_MUX('A', 11, MUX_5)
 #define I2S2_WS_PB12 \
	 AT32_PIN_MUX('B', 12, MUX_5)
 #define I2S2_WS_PB9 \
	 AT32_PIN_MUX('B', 9, MUX_5)
 #define I2S2_WS_PD0 \
	 AT32_PIN_MUX('D', 0, MUX_7)
 #define I2S2_WS_PD1 \
	 AT32_PIN_MUX('D', 1, MUX_7)
 
 /* I2S3_CK */
 #define I2S3_CK_PB12 \
	 AT32_PIN_MUX('B', 12, MUX_7)
 #define I2S3_CK_PB3 \
	 AT32_PIN_MUX('B', 3, MUX_6)
 #define I2S3_CK_PC10 \
	 AT32_PIN_MUX('C', 10, MUX_6)
 
 /* I2S3_MCK */
 #define I2S3_MCK_PB10 \
	 AT32_PIN_MUX('B', 10, MUX_6)
 #define I2S3_MCK_PC7 \
	 AT32_PIN_MUX('C', 7, MUX_6)
 
 /* I2S3_SDEXT */
 #define I2S3_SDEXT_PA14 \
	 AT32_PIN_MUX('A', 14, MUX_6)
 #define I2S3_SDEXT_PB0 \
	 AT32_PIN_MUX('B', 0, MUX_7)
 #define I2S3_SDEXT_PB2 \
	 AT32_PIN_MUX('B', 2, MUX_7)
 #define I2S3_SDEXT_PB5 \
	 AT32_PIN_MUX('B', 5, MUX_6)
 #define I2S3_SDEXT_PC1 \
	 AT32_PIN_MUX('C', 1, MUX_5)
 #define I2S3_SDEXT_PC12 \
	 AT32_PIN_MUX('C', 12, MUX_6)
 #define I2S3_SDEXT_PD0 \
	 AT32_PIN_MUX('D', 0, MUX_6)
 #define I2S3_SDEXT_PD6 \
	 AT32_PIN_MUX('D', 6, MUX_5)
 
 /* I2S3_WS */
 #define I2S3_WS_PA15 \
	 AT32_PIN_MUX('A', 15, MUX_6)
 #define I2S3_WS_PA4 \
	 AT32_PIN_MUX('A', 4, MUX_6)
 
 /* IR_OUT */
 #define IR_OUT_PA13 \
	 AT32_PIN_MUX('A', 13, MUX_1)
 #define IR_OUT_PB9 \
	 AT32_PIN_MUX('B', 9, MUX_0)
 
 /* JNTRST */
 #define JNTRST_PB4 \
	 AT32_PIN_MUX('B', 4, MUX_0)
 
 /* JTCK */
 #define JTCK_PA14 \
	 AT32_PIN_MUX('A', 14, MUX_0)
 
 /* JTDI */
 #define JTDI_PA15 \
	 AT32_PIN_MUX('A', 15, MUX_0)
 
 /* JTDO */
 #define JTDO_PB3 \
	 AT32_PIN_MUX('B', 3, MUX_0)
 
 /* JTMS */
 #define JTMS_PA13 \
	 AT32_PIN_MUX('A', 13, MUX_0)
 
 /* OTG1_D+ */
 #define OTG1_DP_PA12 \
	 AT32_PIN_MUX('A', 12, MUX_10)
 
 /* OTG1_D- */
 #define OTG1_DM_PA11 \
	 AT32_PIN_MUX('A', 11, MUX_10)
 
 /* OTG1_ID */
 #define OTG1_ID_PA10 \
	 AT32_PIN_MUX('A', 10, MUX_10)
 
 /* OTG1_OE */
 #define OTG1_OE_PA13 \
	 AT32_PIN_MUX('A', 13, MUX_10)
 
 /* OTG1_SOF */
 #define OTG1_SOF_PA8 \
	 AT32_PIN_MUX('A', 8, MUX_10)
 
 /* OTG1_VBUS */
 #define OTG1_VBUS_PA9 \
	 AT32_PIN_MUX('A', 9, MUX_10)
 
 /* OTG2_D+ */
 #define OTG2_DP_PB15 \
	 AT32_PIN_MUX('B', 15, MUX_12)
 
 /* OTG2_D- */
 #define OTG2_DM_PB14 \
	 AT32_PIN_MUX('B', 14, MUX_12)
 
 /* OTG2_ID */
 #define OTG2_ID_PB12 \
	 AT32_PIN_MUX('B', 12, MUX_10)
 
 /* OTG2_OE */
 #define OTG2_OE_PC9 \
	 AT32_PIN_MUX('C', 9, MUX_12)
 
 /* OTG2_SOF */
 #define OTG2_SOF_PA4 \
	 AT32_PIN_MUX('A', 4, MUX_12)
 
 /* OTG2_VBUS */
 #define OTG2_VBUS_PB13 \
	 AT32_PIN_MUX('B', 13, MUX_12)
 
 /* SPI1_CS */
 #define SPI1_CS_PA15 \
	 AT32_PIN_MUX('A', 15, MUX_5)
 #define SPI1_CS_PA4 \
	 AT32_PIN_MUX('A', 4, MUX_5)
 #define SPI1_CS_PE12 \
	 AT32_PIN_MUX('E', 12, MUX_4)
 
 /* SPI1_MISO */
 #define SPI1_MISO_PA6 \
	 AT32_PIN_MUX('A', 6, MUX_5)
 #define SPI1_MISO_PB4 \
	 AT32_PIN_MUX('B', 4, MUX_5)
 #define SPI1_MISO_PE14 \
	 AT32_PIN_MUX('E', 14, MUX_4)
 #define SPI1_MISO_PG0 \
	 AT32_PIN_MUX('G', 0, MUX_5)
 
 /* SPI1_MOSI */
 #define SPI1_MOSI_PA7 \
	 AT32_PIN_MUX('A', 7, MUX_5)
 #define SPI1_MOSI_PB5 \
	 AT32_PIN_MUX('B', 5, MUX_5)
 #define SPI1_MOSI_PE15 \
	 AT32_PIN_MUX('E', 15, MUX_4)
 #define SPI1_MOSI_PG1 \
	 AT32_PIN_MUX('G', 1, MUX_5)
 
 /* SPI1_SCK */
 #define SPI1_SCK_PA5 \
	 AT32_PIN_MUX('A', 5, MUX_5)
 #define SPI1_SCK_PB3 \
	 AT32_PIN_MUX('B', 3, MUX_5)
 #define SPI1_SCK_PE13 \
	 AT32_PIN_MUX('E', 13, MUX_4)
 
 /* SPI2_CS */
 #define SPI2_CS_PA11 \
	 AT32_PIN_MUX('A', 11, MUX_5)
 #define SPI2_CS_PB12 \
	 AT32_PIN_MUX('B', 12, MUX_5)
 #define SPI2_CS_PB9 \
	 AT32_PIN_MUX('B', 9, MUX_5)
 #define SPI2_CS_PD0 \
	 AT32_PIN_MUX('D', 0, MUX_7)
 #define SPI2_CS_PD1 \
	 AT32_PIN_MUX('D', 1, MUX_7)
 
 /* SPI2_MISO */
 #define SPI2_MISO_PA12 \
	 AT32_PIN_MUX('A', 12, MUX_5)
 #define SPI2_MISO_PB14 \
	 AT32_PIN_MUX('B', 14, MUX_5)
 #define SPI2_MISO_PC2 \
	 AT32_PIN_MUX('C', 2, MUX_5)
 #define SPI2_MISO_PD3 \
	 AT32_PIN_MUX('D', 3, MUX_6)
 
 /* SPI2_MOSI */
 #define SPI2_MOSI_PA10 \
	 AT32_PIN_MUX('A', 10, MUX_5)
 #define SPI2_MOSI_PB15 \
	 AT32_PIN_MUX('B', 15, MUX_5)
 #define SPI2_MOSI_PC1 \
	 AT32_PIN_MUX('C', 1, MUX_7)
 #define SPI2_MOSI_PC3 \
	 AT32_PIN_MUX('C', 3, MUX_5)
 #define SPI2_MOSI_PD4 \
	 AT32_PIN_MUX('D', 4, MUX_6)
 
 /* SPI2_SCK */
 #define SPI2_SCK_PA9 \
	 AT32_PIN_MUX('A', 9, MUX_5)
 #define SPI2_SCK_PB1 \
	 AT32_PIN_MUX('B', 1, MUX_6)
 #define SPI2_SCK_PB10 \
	 AT32_PIN_MUX('B', 10, MUX_5)
 #define SPI2_SCK_PB13 \
	 AT32_PIN_MUX('B', 13, MUX_5)
 #define SPI2_SCK_PC7 \
	 AT32_PIN_MUX('C', 7, MUX_5)
 #define SPI2_SCK_PD1 \
	 AT32_PIN_MUX('D', 1, MUX_6)
 #define SPI2_SCK_PD3 \
	 AT32_PIN_MUX('D', 3, MUX_5)
 
 /* SPI3_CS */
 #define SPI3_CS_PA15 \
	 AT32_PIN_MUX('A', 15, MUX_6)
 #define SPI3_CS_PA4 \
	 AT32_PIN_MUX('A', 4, MUX_6)
 
 /* SPI3_MISO */
 #define SPI3_MISO_PA13 \
	 AT32_PIN_MUX('A', 13, MUX_6)
 #define SPI3_MISO_PB4 \
	 AT32_PIN_MUX('B', 4, MUX_6)
 #define SPI3_MISO_PC11 \
	 AT32_PIN_MUX('C', 11, MUX_6)
 
 /* SPI3_MOSI */
 #define SPI3_MOSI_PA14 \
	 AT32_PIN_MUX('A', 14, MUX_6)
 #define SPI3_MOSI_PB0 \
	 AT32_PIN_MUX('B', 0, MUX_7)
 #define SPI3_MOSI_PB2 \
	 AT32_PIN_MUX('B', 2, MUX_7)
 #define SPI3_MOSI_PB5 \
	 AT32_PIN_MUX('B', 5, MUX_6)
 #define SPI3_MOSI_PC1 \
	 AT32_PIN_MUX('C', 1, MUX_5)
 #define SPI3_MOSI_PC12 \
	 AT32_PIN_MUX('C', 12, MUX_6)
 #define SPI3_MOSI_PD0 \
	 AT32_PIN_MUX('D', 0, MUX_6)
 #define SPI3_MOSI_PD6 \
	 AT32_PIN_MUX('D', 6, MUX_5)
 
 /* SPI3_SCK */
 #define SPI3_SCK_PB12 \
	 AT32_PIN_MUX('B', 12, MUX_7)
 #define SPI3_SCK_PB3 \
	 AT32_PIN_MUX('B', 3, MUX_6)
 #define SPI3_SCK_PC10 \
	 AT32_PIN_MUX('C', 10, MUX_6)
 
 /* SWCLK */
 #define SWCLK_PA14 \
	 AT32_PIN_MUX('A', 14, MUX_0)
 
 /* SWDIO */
 #define SWDIO_PA13 \
	 AT32_PIN_MUX('A', 13, MUX_0)
 
 /* SWO */
 #define SWO_PB3 \
	 AT32_PIN_MUX('B', 3, MUX_0)
 
 /* TMR10_CH1 */
 #define TMR10_CH1_PB8 \
	 AT32_PIN_MUX('B', 8, MUX_3)
 #define TMR10_CH1_PF6 \
	 AT32_PIN_MUX('F', 6, MUX_3)
 
 /* TMR11_CH1 */
 #define TMR11_CH1_PB9 \
	 AT32_PIN_MUX('B', 9, MUX_3)
 #define TMR11_CH1_PC12 \
	 AT32_PIN_MUX('C', 12, MUX_3)
 #define TMR11_CH1_PF7 \
	 AT32_PIN_MUX('F', 7, MUX_3)
 
