Maxjta/hal_at32/include/dt-bindings/pinctrl/at32f435z(m)xx-pinctrl.h
 /* USART6_RX */
 #define USART6_RX_PA5 \
	 AT32_PIN_MUX('A', 5, MUX_8)
 #define USART6_RX_PA12 \
	 AT32_PIN_MUX('A', 12, MUX_8)
 #define USART6_RX_PC7 \
	 AT32_PIN_MUX('C', 7, MUX_8)
 #define USART6_RX_PG9 \
	 AT32_PIN_MUX('G', 9, MUX_8)
 
 /* USART6_TX */
 #define USART6_TX_PA4 \
	 AT32_PIN_MUX('A', 4, MUX_8)
 #define USART6_TX_PA11 \
	 AT32_PIN_MUX('A', 11, MUX_8)
 #define USART6_TX_PC6 \
	 AT32_PIN_MUX('C', 6, MUX_8)
 #define USART6_TX_PG14 \
	 AT32_PIN_MUX('G', 14, MUX_8)
 
 /* UART7_RX */
 #define UART7_RX_PB3 \
	 AT32_PIN_MUX('B', 3, MUX_8)
 #define UART7_RX_PC1 \
	 AT32_PIN_MUX('C', 1, MUX_8)
 #define UART7_RX_PE7 \
	 AT32_PIN_MUX('E', 7, MUX_8)
 #define UART7_RX_PF6 \
	 AT32_PIN_MUX('F', 6, MUX_8)
 
 /* UART7_TX */
 #define UART7_TX_PB4 \
	 AT32_PIN_MUX('B', 4, MUX_8)
 #define UART7_TX_PC0 \
	 AT32_PIN_MUX('C', 0, MUX_8)
 #define UART7_TX_PE8 \
	 AT32_PIN_MUX('E', 8, MUX_8)
 #define UART7_TX_PF7 \
	 AT32_PIN_MUX('F', 7, MUX_8)
 
 /* USART1_CK */
 #define USART1_CK_PA8 \
	 AT32_PIN_MUX('A', 8, MUX_7)
 #define USART1_CK_PB5 \
	 AT32_PIN_MUX('B', 5, MUX_7)
 
 /* USART1_CTS */
 #define USART1_CTS_PA11 \
	 AT32_PIN_MUX('A', 11, MUX_7)
 
 /* USART1_RTS_DE */
 #define USART1_RTS_DE_PA12 \
	 AT32_PIN_MUX('A', 12, MUX_7)
 
 /* USART1_RX */
 #define USART1_RX_PA10 \
	 AT32_PIN_MUX('A', 10, MUX_7)
 #define USART1_RX_PB3 \
	 AT32_PIN_MUX('B', 3, MUX_7)
 #define USART1_RX_PB7 \
	 AT32_PIN_MUX('B', 7, MUX_7)
 
 /* USART1_TX */
 #define USART1_TX_PA15 \
	 AT32_PIN_MUX('A', 15, MUX_7)
 #define USART1_TX_PA9 \
	 AT32_PIN_MUX('A', 9, MUX_7)
 #define USART1_TX_PB6 \
	 AT32_PIN_MUX('B', 6, MUX_7)
 
 /* USART2_CK */
 #define USART2_CK_PA4 \
	 AT32_PIN_MUX('A', 4, MUX_7)
 #define USART2_CK_PD7 \
	 AT32_PIN_MUX('D', 7, MUX_7)
 
 /* USART2_CTS */
 #define USART2_CTS_PA0 \
	 AT32_PIN_MUX('A', 0, MUX_7)
 #define USART2_CTS_PD3 \
	 AT32_PIN_MUX('D', 3, MUX_7)
 
 /* USART2_RTS_DE */
 #define USART2_RTS_DE_PA1 \
	 AT32_PIN_MUX('A', 1, MUX_7)
 #define USART2_RTS_DE_PD4 \
	 AT32_PIN_MUX('D', 4, MUX_7)
 
 /* USART2_RX */
 #define USART2_RX_PA15 \
	 AT32_PIN_MUX('A', 15, MUX_8)
 #define USART2_RX_PA3 \
	 AT32_PIN_MUX('A', 3, MUX_7)
 #define USART2_RX_PB0 \
	 AT32_PIN_MUX('B', 0, MUX_6)
 #define USART2_RX_PD6 \
	 AT32_PIN_MUX('D', 6, MUX_7)
 
 /* USART2_TX */
 #define USART2_TX_PA14 \
	 AT32_PIN_MUX('A', 14, MUX_8)
 #define USART2_TX_PA2 \
	 AT32_PIN_MUX('A', 2, MUX_7)
 #define USART2_TX_PA8 \
	 AT32_PIN_MUX('A', 8, MUX_8)
 #define USART2_TX_PD5 \
	 AT32_PIN_MUX('D', 5, MUX_7)
 
 /* USART3_CK */
 #define USART3_CK_PB0 \
	 AT32_PIN_MUX('B', 0, MUX_8)
 #define USART3_CK_PB12 \
	 AT32_PIN_MUX('B', 12, MUX_8)
 #define USART3_CK_PC12 \
	 AT32_PIN_MUX('C', 12, MUX_7)
 #define USART3_CK_PD10 \
	 AT32_PIN_MUX('D', 10, MUX_7)
 
 /* USART3_CTS */
 #define USART3_CTS_PA6 \
	 AT32_PIN_MUX('A', 6, MUX_7)
 #define USART3_CTS_PB13 \
	 AT32_PIN_MUX('B', 13, MUX_8)
 #define USART3_CTS_PD11 \
	 AT32_PIN_MUX('D', 11, MUX_7)
 
 /* USART3_RTS_DE */
 #define USART3_RTS_DE_PB1 \
	 AT32_PIN_MUX('B', 1, MUX_8)
 #define USART3_RTS_DE_PB14 \
	 AT32_PIN_MUX('B', 14, MUX_7)
 #define USART3_RTS_DE_PD2 \
	 AT32_PIN_MUX('D', 2, MUX_7)
 #define USART3_RTS_DE_PD12 \
	 AT32_PIN_MUX('D', 12, MUX_7)
 
 /* USART3_RX */
 #define USART3_RX_PB11 \
	 AT32_PIN_MUX('B', 11, MUX_7)
 #define USART3_RX_PC5 \
	 AT32_PIN_MUX('C', 5, MUX_7)
 #define USART3_RX_PC11 \
	 AT32_PIN_MUX('C', 11, MUX_7)
 #define USART3_RX_PD9 \
	 AT32_PIN_MUX('D', 9, MUX_7)
 
 /* USART3_TX */
 #define USART3_TX_PB10 \
	 AT32_PIN_MUX('B', 10, MUX_7)
 #define USART3_TX_PD8 \
	 AT32_PIN_MUX('D', 8, MUX_7)
 #define USART3_TX_PC4 \
	 AT32_PIN_MUX('C', 4, MUX_7)
 #define USART3_TX_PC10 \
	 AT32_PIN_MUX('C', 10, MUX_7)
 